{
    "headerIntro" : "Introduction" ,
	"headerFeatures" : "Features" ,
	"headerUI" : "User Interface" ,
	"FeaturesHeadline" : "Neko Web Application Features" ,
	"FeaturesDesc" : "Here you can see what features Neko Web Application have and maybe try them out.<br>You as developer can use them in your application however you want.<br>Below you can find links for API Documentation to know how to use them." ,
	"FeaturesDarkmode" : "First key feature is Dark Mode that integrated in framework and can be used in every app." ,
	"FeaturesDarkmodeBtn" : "Toogle Dark Mode" ,
	"FeaturesDarkmodeText2" : "Cool, right!?" ,
	"FeaturesCustomElements" : "Custom Elements (or Web Components) are cool and powerful feature allows you to create powerful elements with cool super powers and abilities.<br>Neko Web Application allows with using prototypes and templates create application elements that can be used convenient by your app." ,
	"FeaturesTestElement" : "This is test element!" ,
	"FeaturesTestTemplate" : "This text was inserted here from template." ,
	"FeaturesCustomElementsText2" : "Fun fact that half of this page elements are application custom elements." ,
	"FeaturesModules" : "Application Modules are functional compound blocks that have common sense for application.<br>In Neko Web Application there have various module types as simple, page, header, footer and guide.<br>Simple modules can be used everywhere in app as they are independent, but they can take important role in your app.<br>Example of simple module is presented below." ,
	"FeaturesModulesPage" : "Page modules are key modules because they behave as any site page.<br>They have linked URL, that means if your go to that URL, application will open that URL linked module." ,
	"FeaturesModulesHeader" : "Header module as any header have important role because it have navigation links to easy navigate in your app." ,
	"FeaturesModulesFooter" : "Footer module takes role as footer to put there copyright, privacy policy, terms of use, social pages or any other important links or info there." ,
	"FeaturesModulesGuide" : "Guide module is a sidebar that activates by clicking three-dashed icon and use it's navigation links or anything else." ,
	"FeaturesModulesSubtext" : "Also, modules is not simple custom elements." ,
	"FeaturesWindows" : "Application Windows is important part of application, they need to show system messages or make some kind of dialogs.<br>How they works is almost like modules but targeted to behave as windows. You can open test window to see how it works." ,
	"FeaturesWindowsBtn" : "Open Test Window" ,
	"FeaturesLocale" : "Neko Web Application have convenient way of localization without using page reloading.<br>Check by clicking on language box on left bottom and change to language you know (or don't know anyway you'll be able to change back exactly same way)." ,
	"FeaturesOther" : "And there is more awesome features like Resource Manager, XMLHttpRequests Manager<br>and many more that you'll find out and make useful for your application." ,
	"FeaturesDarkModeLink" : "Read API Documentation for using Dark Mode" ,
	"FeaturesCustomElementsLink" : "Read about setting and using custom elements" ,
	"FeaturesModulesLink" : "Read about setting and using modules" ,
	"FeaturesWindowsLink" : "Read about setting and using windows" ,
	"FeaturesLocaleLink" : "Read about setting and using localization" ,
	"FeaturesCreateLink" : "Read API Documentation for creating elements" ,
	"FeaturesResourceManagerLink" : "Read API Documentation for using Resource Manager" ,
	"FeaturesXHRManagerLink" : "Read API Documentation for using XMLHttpRequests Manager" ,
	"UITestHeadline" : "Neko Web Application User Interface" ,
	"UITestDesc" : "Here you can see all User Interface Elements Neko Web Application have and test how they does stuff they supposed to,<br>and you as developer can use these in your application for any kind of purposes.<br>Below you can find links for API documentation for each one." ,
	"UITestButtons" : "UI Buttons" ,
	"UITestButtonsDesc" : "Neko Web Application has five different type of buttons demonstrated below that you as developer of your app can use however you want." ,
	"UITestButtonLink" : "Read API Documentation for using buttons." ,
	"UITestCheckRadio" : "UI Check Boxes and Radio Buttons" ,
	"UITestCheckRadioDesc" : "Neko Web Application has own convinient checkboxes and radio buttons that you as developer of your app can use however you want." ,
	"UITestCheckLink" : "Read API Documentation for using checkboxes." ,
	"UITestRadioLink" : "Read API Documentation for using radio buttons." ,
	"UITestTextBoxes" : "UI Text Boxes" ,
	"UITestTextBoxesDesc" : "Neko Web Application has text box for typing anything with various style types for your preference." ,
	"UITestTextBoxesLink" : "Read API Documentation for using text boxes." ,
    "UITestComboBoxes" : "UI Combo Boxes" ,
	"UITestComboBoxesDesc" : "Neko Web Application has own combo box with own style for selecting one option for doing various your application stuff." ,
	"UITestComboBoxesLink" : "Read API Documentation for using combo boxes." ,
	"TestWindowTitle" : "Test Window" ,
	"TestWindowText1" : "This is Test Window!" ,
	"TestWindowText2" : "This test window was used to demonstrate, how windows works.<br>You may close this window."
}