{
    "headerIntro" : "Вступление" ,
	"headerFeatures" : "Возможности" ,
	"headerUI" : "Интерфейс пользователя" ,
	"FeaturesHeadline" : "Возможности Neko Web Application" ,
	"FeaturesDesc" : "Здесь вы можете ознакомиться в возможностями Neko Web Application и попробовать их в действии.<br>Вы как разработчик, можете использовать их в вашем приложении как угодно.<br>Внизу можете найти ссылки на API документацию, как их использовать." ,
	"FeaturesDarkmode" : "Первая ключевая возможность это ночной режим, встроенный в фреймворк, позволяющий использовать его в любом приложении." ,
	"FeaturesDarkmodeBtn" : "Переключить ночной режим" ,
	"FeaturesDarkmodeText2" : "Круто, правда!?" ,
	"FeaturesCustomElements" : "Расширенные элементы (или же Веб компоненты) являются крутой и мощной возможностью,<br>позволяющая создавать свои крутые и мощные элементы со своими супер силами и способностями.<br>Neko Web Application позволяет, используя прототипы и шаблоны, создавать элементы, которыми легко управлять самому приложению." ,
	"FeaturesTestElement" : "This is test element!" ,
	"FeaturesTestTemplate" : "This text was inserted here from template." ,
	"FeaturesCustomElementsText2" : "Интересный факт заключается в том, что половина элементов страницы это расширенные элементы приложения." ,
    "FeaturesModules" : "Модули приложения - это составные функциональные блоки, которые естественны для приложений.<br>В Neko Web Application имеются различные типы модулей, как: simple(простой), page(страница), header(навигационная панель), footer(нижний колонтитул) и guide(боковое меню).<br>Простые модули могут быть использованы где угодно, так как они независимы, однако могут иметь важную роль в вашем приложении.<br>Ниже представлен пример простого модуля." ,
	"FeaturesModulesPage" : "Страничные модули являются ключевыми, так как они являются подобиями обычных веб-страниц.<br>У них есть привязанный URL-адрес, что означает, если вы перейдете по этому адресу, приложение запустится с конкретно этим модулем." ,
	"FeaturesModulesHeader" : "Навигационный модуль, как любая навигационная панель, имеет важную роль, так как в нем и сосредоточена вся основная навигация." ,
	"FeaturesModulesFooter" : "Нижний колонтитул для того, чтобы туда расположить копирайт, различные важные ссылки и прочее." ,
	"FeaturesModulesGuide" : "Модуль бокового меню - это то самое боковое меню, которое появляется при нажатии на иконку из трех полосок." ,
	"FeaturesModulesSubtext" : "Также, модули - это не просто обычные расширенные элементы." ,
	"FeaturesWindows" : "Окна приложения - это важная часть приложения, они нужны для отображения системных сообщений или быть системными диалогами.<br>Принцип их работы схож с модулями, но ведут себя как окна. Можете открыть тестовое окно, чтобы посмотреть в действии." ,
	"FeaturesWindowsBtn" : "Открыть тестовое окно" ,
	"FeaturesLocale" : "В Neko Web Application реализован удобный способ работы с локализацией, без необходимости перезагрузки страницы.<br>Убедитесь, сменив язык по кнопке слева внизу и выбрав другой язык." ,
	"FeaturesOther" : "Ну и многие другие возможности, по типу Resource Manager(менеджер ресурсов), XMLHttpRequests Manager(менеджер запросов)<br>доступные для создания вашего собственного приложения." ,
	"FeaturesDarkModeLink" : "Открыть API документацию для использования ночного режима" ,
	"FeaturesCustomElementsLink" : "Открыть документацию по расширенным элементам" ,
	"FeaturesModulesLink" : "Открыть документацию по модулям" ,
	"FeaturesWindowsLink" : "Открыть документацию по окнам" ,
	"FeaturesLocaleLink" : "Открыть документацию по локализации" ,
	"FeaturesCreateLink" : "Открыть API документацию для создания объектов" ,
	"FeaturesResourceManagerLink" : "Открыть API документацию для менеджера ресурсов" ,
	"FeaturesXHRManagerLink" : "Открыть API документацию для менеджера запросов" ,
	"UITestHeadline" : "Интерфейс пользователя Neko Web Application" ,
	"UITestDesc" : "Здесь представлены вашему вниманию все элементы пользовательского интерфейса Neko Web Application и посмотреть то, как они делают то, что они должны делать,<br>также Вы, как разработчик, можете использовать все это для своих различных целей. Внизу вы найдете ссылки на API документацию для каждого элемента." ,
	"UITestButtons" : "Кнопки пользовательского интерфейса" ,
	"UITestButtonsDesc" : "В Neko Web Application имеется пять типов кнопок для различного взаимодействия с ними." ,
	"UITestButtonLink" : "Открыть API документацию для использования кнопок." ,
	"UITestCheckRadio" : "Флажки выбора и переключатели пользовательского интерфейса" ,
	"UITestCheckRadioDesc" : "В Neko Web Application имеются собственные флажки выбора и переключатели для различного взаимодействия с ними." ,
	"UITestCheckLink" : "Открыть API документацию для использования флажков выбора." ,
	"UITestRadioLink" : "Открыть API документацию для использования переключателей." ,
	"UITestTextBoxes" : "Текстовые поля пользовательского интерфейса" ,
	"UITestTextBoxesDesc" : "В Neko Web Application имеется текстовое поле с различными стилями для различного взаимодействия с ним." ,
	"UITestTextBoxesLink" : "Открыть API документацию для использования текстовых полей." ,
    "UITestComboBoxes" : "Списковое поле пользовательского интерфейса" ,
	"UITestComboBoxesDesc" : "В Neko Web Application имеется списковое поле с собственныи стилем для выбора элемента из списка, которые будут выполнять различные действия в вашем приложении." ,
	"UITestComboBoxesLink" : "Открыть API документацию для использования списковых полей." ,
	"TestWindowTitle" : "Тестовое окно" ,
	"TestWindowText1" : "Это тестовое окно!" ,
	"TestWindowText2" : "Это тестовое окно было использовано для деменстрации того, как работают окна.<br>Это окно можно закрыть."
}